Revit 2027 API
ParameterTypeId.RebarBarSpliceLengths Property
 "Splice Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarSpliceLengths { get; }
Public Shared ReadOnly Property RebarBarSpliceLengths As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarSpliceLengths {
	ForgeTypeId^ get ();
}
static member RebarBarSpliceLengths : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace